# while - if - break

# 키보드로부터 양의 정수를 입력 받아, 입력 값을 출력하고 프로그램을 종료
# 입력 값이 음의 정수 또는 0일 경우 재입력

# while True:
#     input_value = int(input("양의 정수를 입력하세요"))

#     if input_value > 0:
#         print("입력 값은 : ", input_value)
#         break



#____________________________________________
# 1 ~ 100 사이 정수 중, 3의 배수이거나 7의 배수인 값을 출력하시오.

# for value in range(1, 101):
#     if value % 3 == 0 or value % 7 == 0:
#         print(value, "\t", end="")


#______________________________________________________________
# 양의 정수 5개를 입력 받아, 합과 평균을 출력하는 프로그램을 작성하시오.
# 입력 값이 양의 정수가 아닐 경우, 에러 메시지를 출력하고 재입력.

#_____________________________________________________________
# 다음과 같이 출력하는 프로그램을 작성
# 1, 3, 5, 7, 9, 11, 13, 15, 17, 19
# 조건: for 문을 사용해서.